export const formations = [
    {
        "id": 1001,
        "name": "【锋矢阵】",
        "effectCells": [1, 4, 7],
        "effects": [
            "前排中：基础防御 +15%，受击回能 +2",
            "中排中：基础武力 +10%，物理吸血 +5%",
            "后排中：攻速 +10"
        ]
    },
    {
        "id": 1002,
        "name": "【雁形阵】",
        "effectCells": [0, 2, 7],
        "effects": [
            "前排左：最终减伤 +8%",
            "前排右：最终减伤 +8%",
            "后排中：基础谋略 +15%，初始能量 +15"
        ]
    },
    {
        "id": 1003,
        "name": "【偃月阵】",
        "effectCells": [1, 3, 5],
        "effects": [
            "前排中：最大兵力 +15%，治疗受护效果 +10%",
            "中排左：每 2 秒恢复 3 点能量",
            "中排右：每 2 秒恢复 3 点能量"
        ]
    },
    {
        "id": 1004,
        "name": "【长蛇阵】",
        "effectCells": [3, 4, 5],
        "effects": [
            "中排左：攻速 +15",
            "中排中：物理穿透 +10%",
            "中排右：攻速 +15"
        ]
    },
    {
        "id": 1005,
        "name": "【玄襄阵】",
        "effectCells": [2, 4, 6],
        "effects": [
            "前排右：武力与谋略 +12%",
            "中排中：双防 +15%",
            "后排左：初始能量 +25"
        ]
    }
];
